{
    "@metadata": {
        "last-updated": "2012-09-21",
        "locale": "en"
    },
    "header-title": "Ritzga's Projects",
    "header-description": "Landing page for Projects of Ritzga",

    "section-nav-home": "Home",
    "section-nav-about": "About Me",
    "section-nav-project": "Projects",
    "section-nav-project-game": "Games",
    "section-nav-project-put": "Put",
    "section-nav-project-animations": "Animations",
    "section-nav-project-wallpaper": "Wallpaper",
    "section-nav-imprint": "Imprint",
    "section-nav-language": "<i class=\"fas fa-flag\"></i> language",
    "section-nav-language-en": "English",
    "section-nav-language-de": "German",
    "section-nav-language-ft": "French",

    "section-welcome-title": "Welcome to my website!",
    "section-welcome-text": "It's nice that you found me and have a good time here. I'm a hobby-devoloper, who do a lot of things like websites, desktop apps, 3D animations, image editing and video engineering. On this homepage you will find some of my projects.",

    "section-about-title": "That's me :3",
    "section-about-general-1": "I'm a weird person, who do a lot of stuff. Normally this stuff have to do with computers. In addition I'm always sleepy.",
    "section-about-general-2": "So I can get interested in things very quickly and then also learn especially fast in this subject. It's like: \"(OwO) whats this, that's interesting too and wow that's also interesting\". That's why I know so many aground the computer and programming stuff. Scientific topics belong to my interests like physic, chemistry, biology and sub-areas. Computer science (informatics) and electrical engineering is of course, one of them.",
    "section-about-hobby-title": "Hobbies",
    "section-about-hobby-text-1": "I like hiking in the forest (forests at night are the best!), swimming in a swimming pool and playing floorball. Furthermore, I like reading books and science magazines. The topics of the books are usually zombie/post-apocalyptic (<a href=\"http://jlbourne.com/\" target=\"_blank\">Day by day armageddon</a> is my favorite book), science fiction novels, science fiction thriller. So yeah, I've read many books.",
    "section-about-hobby-text-2": "I also draw from time to time (my drawn pictures are not so great). But I draw a lot of sketches of every possible things (like architecture and game sketches). I have a big ideas folder where many ideas are implemented not yet (like a smarthome system). I wish I could develop things only with my mind <i class=\"far fa-smile\"></i>.",
    "section-about-skills-title": "Skills",
    "section-about-skills-text-1": "I love programming and started it with <a href=\"https://www.autoitscript.com/site/\" target=\"_blank\">AutoIt3</a>. This is a easy and powerful scripting language with a nice windows GUI. After that I learned HTML/css and so I came to php programming. My first homepage works with html4, css and php4. So I developed a lot of unfinished websites and other projects. At a certain point Autoit was not enough anymore and I started to work with C,C++,C# and Java. This led to that C# becoming my favorite language and <a class=\"jump\" href=\"#content-moreProjects\">Put</a> was my first big project.",
    "section-about-skills-text-2": "The other part is digital art, animations and other creative stuff. I started with the microsoft program \"paint\". After that I used <a href=\"https://www.getpaint.net/\" target=\"_blank\">Paint.net</a> and  <a href=\"https://www.gimp.org/\" target=\"_blank\">Gimp</a>. I've created a lot of pictures with Gimp, it's a nice program and a bit easier then Adobe-Photoshop. I like also to create texture maps for 3D models (mostly metal and stone textures). I had a minecraft texture-pack in the past but I was too bad to make objects (like a table and so on) not only textures.",

    "section-game-title": "Games",
    "section-game-gestrandet-about-title": "About the Game",
    "section-game-gestrandet-about-text-1": "It's a 2D RPG with survival style. The story is that the main character is shipwrecked and saved her/himself on an unknown island. The main quest is to build a ocean-going ship. There are 3 other islands near by the main island. So she/he can build small boats to discover these islands. But be careful, there are some unexpected enemies...",
    "section-game-gestrandet-about-text-2": "The main island is nearby finished and the survival system is active too. So you have to eat to satisfy hunger, to drink to stay hydrated and sleep to stay healthy. In addition, you can't carry too much stuff with you. There is also a time system with day-night cycle. The whole scripts are made by me. The game is playable but not finished yet, so I didn't released it (maybe in a year or two) absolutely after I finished <a class=\"jump\" href=\"#content-moreProjects\">Put</a>.",
    "section-game-gestrandet-about-picture-description-1": "This is an in-game screenshot of the 2D survival game. (The needs are on the top left).",
    "section-game-gestrandet-about-picture-description-2": "Here do you see an editor view of the game scene from the other screenshot. The software to made this game is <a href=\"http://www.rpgmakerweb.com/products/programs/rpg-maker-vx-ace\" target=\"_blank\">RPG Maker VX Ace</a> ,a nice program by the way. The advantage is that you can create a game with a full pack of game-resources.",
    "section-game-planetProspectors-section-1-title": "How it started",
    "section-game-planetProspectors-section-1-text": "It began with a little idea of a game like <a href=\"https://minecraft.net/de-de/\" target=\"_blank\">Minecraft</a> with strategic game elements. So I designed some sketches of the map and all other ideas to the game. I decided to make this game with the <a href=\"https://unity3d.com/de\" target=\"_blank\">Unity engine</a>. (Unity because it's the only engine I know, where you can develop a game with C#). And I used <a href=\"https://ephtracy.github.io/\" target=\"_blank\">MagicaVoxel</a> to make some 3D placeholder models.",
    "section-game-planetProspectors-section-1-picture-description": "This was the first sketch of my the game. It shows the planned world with water, ground and walls.",
    "section-game-planetProspectors-section-2-title": "What's now",
    "section-game-planetProspectors-section-2-text": "Now I have a Team of 3 students to work on the game in our free time. One of us is a great 3D digital artist His name is <a href=\"https://tohmis.deviantart.com/\" target=\"_blank\">Thomis</a> (take a look on his deviantart page). The another one is a super smart bear, who is a awesome programmer and software developer. His name is <a href=\"https://github.com/Sythelux\" target=\"_blank\">Sythelux Rikd</a>. Maybe we can make a playable version of the game. If yes, you will can download it here.",
    "section-game-planetProspectors-section-2-picture-description": "Full shaded (post processing effects) picture of an early version of the game in unity.",

    "section-otherproject-put-title": "Put (project updater tool)",
    "section-otherproject-put-description-title": "Description",
    "section-otherproject-put-description-picture-description": "Here do you see the client of the Put. It's really intuitive to use the client.",
    "section-otherproject-put-description-text": "The Put (project updater tool) is like <a href=\"https://git-scm.com/\" target=\"_blank\">Git</a> a version control system. My Tool is way easier and simpler as git and specified for projects like games, software or tools, where updated often. So Put is a good way to have a fast updater for your projects. The whole app is programmed with C# and works on linux and windows. It's currently under construction and not public.",
    "section-otherproject-put-todo-title": "To Do",
    "section-otherproject-put-todo-text": "The current version is 0.1 (so it's a pre alpha version and it works well on windows or linux (32/64 bit)). It's planned that Put works also on android and ios. The whole interface will be written in <a href=\"https://electronjs.org/\" target=\"_blank\">Electron</a>. It's also on the to do list, that Put supports cloud systems (like ondrive, google drive or owncloud) and Git. So it would be easier for admins.",
    "section-otherproject-put-todo-picture-description": "This is the admin tool of Put and you can see a test project. It's easy to create new projects the only thing you need is a server with FTP or SFTP and a web access.",
    "section-otherproject-art-title": "Digital Art & 2D/3D-Animations",
    "section-otherproject-art-3d-title": "3D Animations",
    "section-otherproject-art-3d-text": "I started working with the <a href=\"http://sourcefilmmaker.com/\" target=\"_blank\">Source film maker (SFM)</a> three years ago. It was very nice to make some animations but at a specific point my skills are too bad for extended animations so I stopped to make 3D animations. So by the way if you want to watch some animations take a look at this <a href=\"https://www.youtube.com/playlist?list=PLC28A3B3A486E392B\" target=\"_blank\">Playlist</a> on youtube.",
    "section-otherproject-art-3d-video-description": "My last animation made with the SFM. Here I tested some custom particles (snow particles) and it was at christmas time.",
    "section-otherproject-art-2d-title": "",
    "section-otherproject-art-2d-text": "One of my dreams was to make a super nice intro for my videos on Youtube. So started to make videos with the \"Microsoft movie-maker\". After that I used <a href=\"https://www.techsmith.de/camtasia.html\" target=\"_blank\">camtasia studio</a>. My animations and videos got better but I didn't stop and made the intro (see right) with <a href=\"https://www.adobe.com/de/products/aftereffects.html\" target=\"_blank\">After Effects CC</a> (it was the test version, but yes it was enough to make something of it)",
    "section-otherproject-art-2d-video-description": "This is my Intro for the youtube channel. This is my best animation I've ever made and it looks very awesome.",

    "section-wallpaper-text": "Here are some of my wallpapers I made with <a href=\"https://www.gimp.org/\" target=\"_blank\">Gimp</a>, <a href=\"https://www.getpaint.net/\" target=\"_blank\">Paint.net</a> and <a href=\"https://www.adobe.com/de/products/photoshop.html\" target=\"_blank\">Adobe Photoshop CC</a>. If you want to see all wallpapers, you can take a look on <a href=\"https://ritzga.deviantart.com/\" target=\"_blank\">deviantart.com</a>. I also used some special brushes (look on the credits of the picture on deviantart). I have to thank all the artists who created these. And yes I love hexagons very much! So if you have some ideas for great pictures ask me any time (I appreciate it <i class=\"far fa-smile\"></i>).",
    "section-wallpaper-picture-1": "This is one of my first wallpapers I've released on deviantart and I'm still like it.",
    "section-wallpaper-picture-2": "Here I tested some new effects and my skills on abstract pictures (It didn't turn out as well as I had imagined).",
    "section-wallpaper-picture-3": "After I found out how I create planets I created this awesome picture (this is also a first test of the dust particle).",
    "section-wallpaper-picture-4": "One of my best picture I've ever created. The spaceship was made by a good friend.",
    "section-wallpaper-picture-5": "Actually this is only a brush but it's a good effect, so I decided to make a wallpaper and yes it has become beautiful. It's sad that the picture is a bit blurred and not 100% sharp, but I can't change it anymore.",
    "section-wallpaper-picture-6": "Yep, one of my favorite pictures. Here I inverted the hexagons and got a interesting effect. I also made some smaller hexagons and put it under the big ones to got a little 3D effect.",

    "section-footer-nav-title": "Navigation",
    "section-footer-contact-title": "Contact",
    "section-footer-ppi": "privacy policy and imprint",
    "section-footer-copyright": "© 2017-2018 Ritzga, Inc. All Right Reserved.  Designed by <a class=\"color-white-hyperlink\" href=\"https://Ritzga.dog\">Ritzga</a>"
}